# VerticalLayerExtensionFailureError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..VerticalLayerExtensionFailureError Property
BuiltInFailures..::..WallFailures Class See Also
---
Cannot extend layer(s) of the highlighted vertically compound wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId VerticalLayerExtensionFailureError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VerticalLayerExtensionFailureError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ VerticalLayerExtensionFailureError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace